
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПланОтдела
	Движения.ПланОтдела.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.ПланОтдела.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ВидПлана = ВидПлана;
		Движение.ПланНаМесяц = ТекСтрокаСотрудники.ПланНаМесяц;
		Движение.ЦельНаМесяц = ТекСтрокаСотрудники.ЦельНаМесяц;
		Движение.СертификатыСК = ТекСтрокаСотрудники.СертификатыСК;
		Движение.СертификатыПРОФ = ТекСтрокаСотрудники.СертификатыПРОФ;
		Движение.НормаНарядов = ТекСтрокаСотрудники.НормаНарядов;
		Движение.СреднееВремяНаНаряд = ТекСтрокаСотрудники.СреднееВремяНаНаряд;
		Движение.Подразделение = Подразделение;
		Движение.НачалоПериода = НачалоПериода;
		Движение.КонецПериода = КонецПериода;
	КонецЦикла;


КонецПроцедуры
