
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтавкиСотрудников
	Движения.СтавкиСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.СтавкиСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаСписокСотрудников
		, "Сотрудник,Ставка,СхемаМотивации");
		Движение.Период = ЭтотОбъект.Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
