
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланПроекта
	Движения.ПланПроекта.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ПланПроекта.Добавить();
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Работа = ТекСтрокаСостав.Работа;
		Движение.ДатаНачала = ТекСтрокаСостав.ДатаНачала;
		Движение.ДатаЗавершения = ТекСтрокаСостав.ДатаЗавершения;
		Движение.БюджетМинимальный = ТекСтрокаСостав.БюджетМинимальный;
		Движение.БюджетМаксимальный = ТекСтрокаСостав.БюджетМаксимальный;
		Движение.ТипБюджета = ТекСтрокаСостав.ТипБюджета;
		Движение.СтоимостьВСметеМинимум = ТекСтрокаСостав.СтоимостьВСметеМинимум;
		Движение.СтоимостьВСметеМаксимум = ТекСтрокаСостав.СтоимостьВСметеМаксимум;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
