
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ТекущаяНеделя = НеделяГода(ТекущаяДата()); 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СпринтыПоСделкамСрезПоследних.Ответственный КАК Ответственный,
	//	|	НЕДЕЛЯ(СпринтыПоСделкамСрезПоследних.Регистратор.Дата) КАК Неделя
	//	|ИЗ
	//	|	РегистрСведений.СпринтыПоСделкам.СрезПоследних(, НЕДЕЛЯ(Регистратор.Дата) = &Неделя) КАК СпринтыПоСделкамСрезПоследних";
	//
	//Запрос.УстановитьПараметр("Неделя", ТекущаяНеделя);
	//ЗАпрос.УстановитьПараметр("Ответственный
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если НЕ РезультатЗапроса.Пустой() И Объект.Ответственный.Наименование = "" Тогда
	//	Сообщить("На этой неделе уже создавался документ!");
	//	Отказ = Истина;
	//КонецЕсли;	
//>>
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
	//Состав = Элементы.СоставСпринта.ТекущиеДанные;
	//
	//Для каждого ЭлементМассива из ДанныеТаблицы Цикл
	//	Для каждого элемент из ЭлементМассива Цикл
	//		
	//	КонецЦикла;	
	//КонецЦикла;
	//
	//Состав = Элементы.СоставСпринта.ТекущиеДанные;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если Объект.Ответственный.Пустая() Тогда
		Сообщить("Выберите Ответственного!");
		Отказ = истина;
		Возврат;
	КонецЕсли;	
	
	
	//<<Невозможно проводить заполнение, если есть более новый документ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпринтыПоСделкам.Регистратор.Дата КАК РегистраторДата,
		|	СпринтыПоСделкам.Ответственный КАК Ответственный
		|ИЗ
		|	РегистрСведений.СпринтыПоСделкам КАК СпринтыПоСделкам
		|ГДЕ
		|	СпринтыПоСделкам.Регистратор.Дата > &Дата
		|	И СпринтыПоСделкам.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("ответственный", Объект.Ответственный);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Сообщить("Невозможно загрузить сделки! Присутствует болле новый документ!");
		Отказ = истина;
		Возврат;
	КонецЕсли;
	//Невозможно проводить заполнение, если есть более новый документ>>

	
	
	//Защита от повторного нажатия, добавляются только те строки, которых еще нет в документе
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сделки.Аккаунт КАК Аккаунт,
		|	Сделки.Ссылка КАК Сделка,
		|	Сделки.Клиент КАК Клиент
		|ПОМЕСТИТЬ ВТ_Сделки
		|ИЗ
		|	Справочник.Сделки КАК Сделки
		|ГДЕ
		|	Сделки.Аккаунт = &Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпринтыПоСделкамСрезПоследних.ДатаЗавершенияСпринта КАК ДатаЗавершенияСпринта,
		|	ВТ_Сделки.Сделка КАК Сделка,
		|	ВТ_Сделки.Клиент КАК Клиент,
		|	СпринтыПоСделкамСрезПоследних.Ответственный КАК Ответственный,
		|	СпринтыПоСделкамСрезПоследних.ТекущийСтатус КАК ТекущийСтатус,
		|	СпринтыПоСделкамСрезПоследних.НовыйСтатус КАК НовыйСтатус,
		|	СпринтыПоСделкамСрезПоследних.ФактическийСтатус КАК ФактическийСтатус,
		|	СпринтыПоСделкамСрезПоследних.Сделали КАК Сделали,
		|	СпринтыПоСделкамСрезПоследних.ПланНаНеделю КАК ПланНаНеделю,
		|	СпринтыПоСделкамСрезПоследних.ФактПоИтогамНедели КАК ФактПоИтогамНедели,
		|	СпринтыПоСделкамСрезПоследних.ПолучилиЖелаемыйРезультат КАК ПолучилиЖелаемыйРезультат,
		|	СпринтыПоСделкамСрезПоследних.Выводы КАК Выводы
		|ИЗ
		|	ВТ_Сделки КАК ВТ_Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпринтыПоСделкам.СрезПоследних(
		|				&ТекущаяДата,
		|				Ответственный = &Ответственный
		|					И НЕ (Сделка, Клиент) В
		|							(ВЫБРАТЬ
		|								СпринтСоставСпринта.Сделка КАК Сделка,
		|								СпринтСоставСпринта.Клиент КАК Клиент
		|							ИЗ
		|								Документ.Спринт.СоставСпринта КАК СпринтСоставСпринта
		|							ГДЕ
		|								СпринтСоставСпринта.Ссылка = &Ссылка)) КАК СпринтыПоСделкамСрезПоследних
		|		ПО ВТ_Сделки.Аккаунт = СпринтыПоСделкамСрезПоследних.Ответственный
		|			И ВТ_Сделки.Сделка = СпринтыПоСделкамСрезПоследних.Сделка
		|			И ВТ_Сделки.Клиент = СпринтыПоСделкамСрезПоследних.Клиент";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Ответственный", Объект.Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаЗначений = Объект.СоставСпринта.Выгрузить();		
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
			СтрокаТЧ = Объект.СоставСпринта.Добавить();
			СтрокаТЧ.Сделка = ВыборкаДетальныеЗаписи.Сделка;
			СтрокаТЧ.Клиент = ВыборкаДетальныеЗаписи.Клиент;
			СтрокаТЧ.ТекущийСтатус = ВыборкаДетальныеЗаписи.ТекущийСтатус;
			СтрокаТЧ.НовыйСтатус = ВыборкаДетальныеЗаписи.НовыйСтатус;
			СтрокаТЧ.ФактическийСтатус = ВыборкаДетальныеЗаписи.ФактическийСтатус;
			СтрокаТЧ.ПланНаНеделю = ВыборкаДетальныеЗаписи.ПланНаНеделю;
			СтрокаТЧ.ФактПоИтогамНедели = ВыборкаДетальныеЗаписи.ФактПоИтогамНедели;
			СтрокаТЧ.Сделали = ВыборкаДетальныеЗаписи.Сделали;
			СтрокаТЧ.ПолучилиЖелаемыйРезультат = ВыборкаДетальныеЗаписи.ПолучилиЖелаемыйРезультат;
			СтрокаТЧ.Выводы = ВыборкаДетальныеЗаписи.Выводы;	
	КонецЦикла;	

//>>		
КонецПроцедуры
