
Функция СчетЗаписатьСчет(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	КодКонтрагента = СокрЛП(Запрос.параметрыЗапроса.Получить("KA_code"));
	ИННКонтрагента = Запрос.параметрыЗапроса.Получить("KA_INN");
	НомерСчетаКонтрагента = Запрос.параметрыЗапроса.Получить("INV_NO");
	ИННОрганизация = Запрос.параметрыЗапроса.Получить("ORG_INN");
	СуммаСчета = Запрос.параметрыЗапроса.Получить("INV_SUMM");
	
	ДатаСчетаКонтрагента = Запрос.параметрыЗапроса.Получить("INV_DATA");
	КППКонтрагента = Запрос.параметрыЗапроса.Получить("KA_KPP");
	НаименованиеКонтрагента = Запрос.параметрыЗапроса.Получить("KA_NAME");
	НаименованиеПолноеКонтрагента = Запрос.параметрыЗапроса.Получить("KA_FULLNAME");
	КомментарийКонтрагента = Запрос.параметрыЗапроса.Получить("KA_COMMENT");
	ОписаниеСчетаКонтрагента= Запрос.параметрыЗапроса.Получить("INV_WORK");
	//*********Секция проверки наличия контрагента
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос0 = Новый Запрос;
	Запрос0.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Код КАК Код
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Код = &Код";
	Запрос0.УстановитьПараметр("Код", КодКонтрагента);
	РезультатЗапроса0 = Запрос0.Выполнить();
	Если  РезультатЗапроса0.Пустой() Тогда
		//проверка ИНН
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.ИНН КАК ИНН,
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.ИНН = &ИНН
		|	И ВЫБОР
		|			КОГДА Клиенты.КПП = """"
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Клиенты.КПП = &КПП
		|		КОНЕЦ";
		Запрос1.УстановитьПараметр("ИНН", ИННКонтрагента);
		Запрос1.УстановитьПараметр("КПП", КППКонтрагента);
		РезультатЗапроса1 = Запрос1.Выполнить();
		Если  РезультатЗапроса1.Пустой() Тогда
			
				НовыйКонтрагент = Справочники.Клиенты.СоздатьЭлемент(); 
				НовыйКонтрагент.Наименование = НаименованиеКонтрагента; 
				НовыйКонтрагент.НаименованиеПолное = НаименованиеПолноеКонтрагента; 
				НовыйКонтрагент.ИНН = ИННКонтрагента; 
				НовыйКонтрагент.КПП = КППКонтрагента; 
				НовыйКонтрагент.Комментарий = КомментарийКонтрагента;
				НовыйКонтрагент.Записать();
		        КлиентССылка = НовыйКонтрагент.Ссылка;
			// конецПроверкаКПП	
		Иначе
			ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
			ВыборкаДетальныеЗаписи1.Следующий();
			КлиентССылка =  ВыборкаДетальныеЗаписи1.Ссылка;
			ОбъектСправочника = КлиентССылка.ПолучитьОбъект(); 
			ОбъектСправочника.Код = КодКонтрагента;
			ОбъектСправочника.ИНН = ИННКонтрагента;
			ОбъектСправочника.КПП = КППКонтрагента;
			ОбъектСправочника.Записать();	
			
			
		КонецЕсли; //проверкаИНН
	Иначе
		ВыборкаКлиент=РезультатЗапроса0.Выбрать();
		ВыборкаКлиент.Следующий();
		КлиентССылка= ВыборкаКлиент.Ссылка;
	КонецЕсли; //проверка Код
	//********************************************
	
	
	
	
	
	ЗапросДок = Новый Запрос;
	ЗапросДок.Текст = 
	"ВЫБРАТЬ
	|	Задача.Номер КАК Номер,
	|	Задача.СуммаСчета КАК СуммаСчета
	|ИЗ
	|	Документ.Задача КАК Задача
	|ГДЕ
	|	Задача.Номер = &Номер";
	
	ЗапросДок.УстановитьПараметр("Номер", СокрЛП(НомерСчетаКонтрагента));
	РезультатЗапросаДок = ЗапросДок.Выполнить();
	Если    РезультатЗапросаДок.Пустой() Тогда
		Задача = Документы.Задача.СоздатьДокумент();	
		Задача.НомерСчета=СокрЛП(НомерСчетаКонтрагента);
		ОрганизацииДляПоиска = Справочники.Организации; //Организации
		СсылкаНайденнойОрганизации= ОрганизацииДляПоиска.НайтиПоРеквизиту("ИНН",ИННОрганизация);
		Если ЗначениеЗаполнено(СсылкаНайденнойОрганизации)  Тогда
			Задача.Организация= ИННОрганизация;
		КонецЕсли; //организации конец
		
		Задача.Клиент= КлиентССылка;
		Задача.Тема= "Счет №"+НомерСчетаКонтрагента+" от "+ДатаСчетаКонтрагента+", "+НаименованиеКонтрагента;
		Задача.Описание = ОписаниеСчетаКонтрагента;
		
		
	Иначе // здесь код проверки суммы документа
		ВыборкаКлиентДок=РезультатЗапросаДок.Выбрать();
		ВыборкаКлиентДок.Следующий();
		Если ВыборкаКлиентДок.СуммаСчета= Суммасчета Тогда
		Иначе
			
        ВыборкаКлиентДок.СуммаСчета=СуммаСчета;
	    КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СчетПолучитьСчет(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Йохохо");
	Возврат Ответ;
КонецФункции

Функция testget(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Все готово");
	Возврат Ответ;
КонецФункции

Функция pushСвязь(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция pushЗаписать(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	//Мы получаем из внешнего источника данные по задаче
	
	
	
	Возврат Ответ;
КонецФункции

//{
//  "bill":{
//    "number" : "017/20202002",
//    "date" : "",
//    "sum" : 3150.0,
//    "list" : [
//      { 
//        "subject" : "",
//        "qnty" : 1,
//        "price" : 3150.0,
//        "sum" : 3150.0,
//        "vat" : 0
//      }
//    ]  
//  },
//  "client" : {
//    "code" : "017/02002022",
//    "inn" : "78003239932",
//    "name" : "ООО ВВВвадда",
//    "sponsor" : {
//      "name" : "Иванов Иван Иванович",
//      "phone": "+7 (932) 332-33-33",
//      "email" : "some@gmail.com",
//      "jobtitle" : "Директор"
//    },
//    "contact" : {
//      "name" : "Иванов Иван Иванович",
//      "phone": "+7 (932) 332-33-33",
//      "email" : "some@gmail.com",
//      "jobtitle" : "Директор"
//    },
//    "location" : {
//      "subway" : "",
//      "code" : "",
//      "text" : ""
//    }
//  },
//  "accountmanager" : "AAndreev@1cbit.ru"
//}
