
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	ВсегоЧасов = РабочееВремя.Итог("Длительность");
	ЧасовВОтчет = РабочееВремя.Итог("ЧасыВОтчет");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр Часы Приход
	Движения.Часы.Записывать = Истина;
	Для Каждого ТекСтрокаРабочееВремя Из РабочееВремя Цикл
		Движение = Движения.Часы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = ТекСтрокаРабочееВремя.Клиент;
		Движение.Задача = ТекСтрокаРабочееВремя.ЗадачаДок;
		Движение.ЗадачаНовая = ТекСтрокаРабочееВремя.Задача;
		// ++ БИТ МИС 08042021
		// вместо
		//Движение.Ответственный = Пользователь;
		Движение.Ответственный = Пользователь.Пользователь;
		// -- БИТ МИС
		Движение.Отчет = ТекСтрокаРабочееВремя.ЧасыВОтчет;
		Движение.Факт = ТекСтрокаРабочееВремя.Длительность;
	КонецЦикла;
	
	// регистр Время 
	Движения.Время.Записывать = Истина;
	Для Каждого ТекСтрокаРабочееВремя Из РабочееВремя Цикл
		Движение = Движения.Время.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = ТекСтрокаРабочееВремя.Клиент;
		Движение.Задача = ТекСтрокаРабочееВремя.ЗадачаДок;
		Движение.ЗадачаНовая = ТекСтрокаРабочееВремя.Задача;
		// ++ БИТ МИС 08042021
		// вместо
		//Движение.Ответственный = Пользователь;
		Движение.Ответственный = Пользователь.Пользователь;
		// -- БИТ МИС
		
		Движение.Факт = ТекСтрокаРабочееВремя.Длительность;
		Движение.Отчет = ТекСтрокаРабочееВремя.ЧасыВОтчет;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
