
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОбработкаПроверкиЗаполнения(Отказ, Новый Массив);
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	Движения.Трудозатраты.Записывать = Истина;
	
	Для Каждого яСтрока Из ОплачиваемыеЗадания Цикл
		Движение = Движения.Трудозатраты.ДобавитьРасход();
		Движение.Период = ?(ЗначениеЗаполнено(яСтрока.ДатаСписания), яСтрока.ДатаСписания, Дата);
		Движение.Задача = яСтрока.Документ;
		Движение.Ответственный	= яСтрока.Ответственный;
		Движение.Отчет = яСтрока.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.КоличествоЧасов = ОплачиваемыеЗадания.Итог("Количество");
	ЭтотОбъект.СуммаДокумента = ОплачиваемыеЗадания.Итог("Сумма");
КонецПроцедуры
