
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		  ОбщегоНазначенияКлиент.СообщитьПользователю("Создать подключение для провдения автотестов Ванессой возможно только после записи данных. Строка подключения должна быть заполнена. Запишите, пожалуйста, и повторите запуск.");
		  Возврат;
	КонецЕсли;
		
	ДопПарметры = Новый Структура;
	ДопПарметры.Вставить("База",ПараметрКоманды);
	ВА_ВанессаСервер.ЗаполнитьПараметрыЗапускаТестовПоБазе(ДопПарметры); 
 	ДопПарметры.Вставить("СохранитьНастройкиВФайл",ДопПарметры.ФайлНастроек);
		
	ВыбФайл = Новый Файл(ДопПарметры.ФайлНастроек);
	Если ВыбФайл.Существует() Тогда
		ЗапуститьВанессуИЗагрузитьПараметрыИзФайла(ДопПарметры);
	Иначе 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найден файл нстроек " + ДопПарметры.ФайлНастроек + Символы.ПС
				+ "обновите данные с гита или скопируйте по указанному адресу файл настроек, на основании которого будут созданы настройки";
		Сообщение.Сообщить();  
		Возврат;
    КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьВанессуИЗагрузитьПараметрыИзФайла(ДопПарметры)
	
	ФормаВанессы = ПолучитьФорму("Обработка.VanessaAutomationsingle.Форма.УправляемаяФорма");		
	ФормаВанессы.Открыть();
	
	ДопПарметры.Вставить("ФормаВанессы",ФормаВанессы);	
	
	ЗагрузитьНастройки(ДопПарметры);
	
КонецПроцедуры	     



&НаКлиенте
Процедура ЗагрузитьНастройки(ДопПарметры) 
	
	Если ДопПарметры.ФайлНастроек = ДопПарметры.СохранитьНастройкиВФайл Тогда
		ТекстСохранения =  Символы.ПС + " Обновленные настройки будут сохранены в тот же файл";
	Иначе
		ТекстСохранения =  Символы.ПС + "Обновленные настройки будут сохранены в файл " + Символы.ПС + ДопПарметры.СохранитьНастройкиВФайл;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьНастройкиОповещение", ЭтотОбъект, ДопПарметры);
	ПоказатьПредупреждение(Оповещение, "В настройки Ванессы из файла "+ДопПарметры.ФайлНастроек+" будет добавлено подключение клиента тестирования." + ТекстСохранения, 7, "Загрузка настроек Ванессы из файла");
	
КонецПроцедуры
		
&НаКлиенте
Процедура ЗагрузитьНастройкиОповещение(ДопПарметры) Экспорт
	
	Отказ = Ложь;
	ФормаВанессы = ДопПарметры.ФормаВанессы; 
	
	ЗагрузитьНастройкиПоУмолчанию(ДопПарметры,Отказ);
	
	Если НЕ Отказ Тогда
		СоздатьПодключениеКлиентаТестирования(ДопПарметры);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте 
Процедура ЗагрузитьНастройкиПоУмолчанию(ДопПарметры, Отказ)
	
	ФормаВанессы = ДопПарметры.ФормаВанессы; 
	ФормаВанессы.Объект.КаталогФич = ДопПарметры.КаталогФич;
	
	Если ДопПарметры.ФайлНастроек = "" Тогда
		Отказ = Истина;
		Сообщить("Не найден файл настроек");
	Иначе
		ДопПараметрыЗагрузки = Новый Структура;
		ВернутьНастройки = Новый Структура;
		ВернутьНастройки.Вставить("КаталогФич", ФормаВанессы.Объект.КаталогФич);
		ДопПараметрыЗагрузки.Вставить("ВернутьНастройки", ВернутьНастройки);
		ВыбранныеФайлы = Новый Массив;
		ВыбранныеФайлы.Добавить(ДопПарметры.ФайлНастроек);   	
		ФормаВанессы.ЗагрузитьНастройкиИзФайлаЗавершение(ВыбранныеФайлы, ДопПараметрыЗагрузки);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПодключениеКлиентаТестирования(ДопПарметры)

	ФормаВанессы = ДопПарметры.ФормаВанессы; 
	Подключения = ФормаВанессы.ДанныеКлиентовТестирования;	
	НадоДобавитьПодключение = Истина;
	
	Для каждого Строка Из Подключения Цикл
	   Если Строка.Имя = ДопПарметры.БазаНаименование 
		  И Строка.ДопПараметры = ДопПарметры.ВанессаДопПараметры  
		  И	Строка.ПутьКИнфобазе = ДопПарметры.ВанессаПутьБазе Тогда
		    НадоДобавитьПодключение = Ложь;
       КонецЕсли;
	КонецЦикла;	
	
	СохранитьНастройкиВФайл = НЕ ДопПарметры.ФайлНастроек = ДопПарметры.СохранитьНастройкиВФайл;
		
	Если НадоДобавитьПодключение Тогда
	    НоваяСтрока = Подключения.Добавить();
		НоваяСтрока.ДопПараметры = ДопПарметры.ВанессаДопПараметры;
	    НоваяСтрока.Имя	= ДопПарметры.БазаНаименование; 
	    НоваяСтрока.Синоним	= ДопПарметры.БазаНаименование; 		
		НоваяСтрока.ПутьКИнфобазе = ДопПарметры.ВанессаПутьБазе;
		НоваяСтрока.ТипКлиента = "Тонкий";      
		
		ТекстСообщения = "Добавлено подключение клиента тестирования";
		СохранитьНастройкиВФайл = Истина;
	Иначе  
		ТекстСообщения = "В подключение клиента тестирования было  создано ранее";		
	КонецЕсли;  
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Если СохранитьНастройкиВФайл Тогда
		Файл = Новый Массив;
		Файл.Добавить(ДопПарметры.СохранитьНастройкиВФайл);
		ФормаВанессы.ВыгрузитьНастройкиВФайлЗавершение(Файл, ДопПарметры);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Настройки сохранены в файл " + Символы.ПС + ДопПарметры.СохранитьНастройкиВФайл;
		Сообщение.Сообщить();
	КонецЕсли; 
		
КонецПроцедуры // СоздатьПодключениеКлиентаТестирования(ДопПарметры)()
