
&НаСервереБезКонтекста
Процедура ЗапуститьНаСервере(ъОбращение, ъКраткоеОписание, ъВремяЗапуска)
	Обработки.ITC_Таймер.ЗапуститьТаймер(ъОбращение, ПараметрыСеанса.ТекущийПользователь, ъКраткоеОписание, ъВремяЗапуска);
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	Если ПустаяСтрока(КраткоеОписание) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.КраткоеОписание;
		Возврат;
	КонецЕсли;
	ЗапуститьНаСервере(Задача, КраткоеОписание, ВремяЗапуска);
	ОповеститьОВыборе(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ВремяЗапуска,Задача");
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть();
КонецПроцедуры
