
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОборотыПоБюджетам 
	Движения.ОборотыПоБюджетам.Записывать = Истина;
	Для Каждого ТекСтрокаЗаписи Из Записи Цикл
		Движение = Движения.ОборотыПоБюджетам.Добавить();
		Движение.Период = Дата;
		Движение.Сценарий = Сценарий;
		Движение.Статья = ТекСтрокаЗаписи.Статья;
		Движение.Направление = ТекСтрокаЗаписи.Направление;
		Движение.Клиент = ТекСтрокаЗаписи.Клиент;
		Движение.Проект = ТекСтрокаЗаписи.Проект;
		Движение.Сумма = ТекСтрокаЗаписи.Сумма;
		Движение.НДС = ТекСтрокаЗаписи.НДС;
		Движение.СуммаБезНДС = ТекСтрокаЗаписи.СуммаБезНДС;
		Движение.Комментарий = ТекСтрокаЗаписи.Комментарий;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
