
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВыполненныеРаботы Расход
	Движения.ВыполненныеРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРабот Из СписокРабот Цикл
		Движение = Движения.ВыполненныеРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Работа = ТекСтрокаСписокРабот.Работа;
		Движение.Сотрудник = ТекСтрокаСписокРабот.Сотрудник;
		Движение.Объем = ТекСтрокаСписокРабот.КЗакрытию+ТекСтрокаСписокРабот.КСписанию;
	КонецЦикла;

	// регистр ЗатратыПоПроектам 
	Движения.ЗатратыПоПроектам.Записывать = Истина;
	Для Каждого ТекСтрокаСписокРабот Из СписокРабот Цикл
		Движение = Движения.ЗатратыПоПроектам.Добавить();
		Движение.Период = Дата;
		Движение.Проект = Проект;
		Движение.Работа = ТекСтрокаСписокРабот.Работа;
		Движение.Объем = ТекСтрокаСписокРабот.Стоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
