
&НаКлиенте
Процедура ДобавитьФайл(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	яОповещение = Новый ОписаниеОповещения("ДобавитьФайл_Завершение", ЭтаФорма);
	НачатьПомещениеФайла(яОповещение,,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл_Завершение(Результат, Адрес, 
        ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат = Истина Тогда
		ДобавитьФайл_Завершение_Сервер(Адрес, ВыбранноеИмяФайла);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ДобавитьФайл_Завершение_Сервер(Адрес, ВыбранноеИмяФайла)
	яХЗ = ПолучитьИзВременногоХранилища(Адрес);
	яОб = Объект.Ссылка.ПолучитьОбъект();
	яОб.Содержимое = Новый ХранилищеЗначения(яХЗ, Новый СжатиеДанных(0));
	яОб.Записать();
	
	//яФ = Новый файл(ВыбранноеИмяФайла);
	//Объект.ИмяФайлаОбработки = яФ.Имя;
	//Объект.Содержимое = Новый ХранилищеЗначения(яХЗ, Новый СжатиеДанных(0));
	
КонецПроцедуры
