
&НаКлиентеНаСервереБезКонтекста
Функция ЗашифроватьBase64Сервер(Строка, КодировкаТекста = "UTF-8") Экспорт
	
	ДД = ПолучитьДвоичныеДанныеИзСтроки(Строка, КодировкаТекста);
	Стр64 = ПолучитьBase64СтрокуИзДвоичныхДанных(ДД);
	Возврат Стр64; 
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Пароль) Тогда
		Объект.Авторизация = "Basic " + ЗашифроватьBase64Сервер(Пользователь + ":" + Пароль);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗадачиНаСервере()
	ITC_JIRA.ПолучитьЗадачи(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗадачи(Команда)
	ЗагрузитьЗадачиНаСервере();
КонецПроцедуры

&НаСервере
Функция РучнойЗапросНаСервере()
	яКеш = Новый Структура;
	яРез = ITC_JIRA.ПолучитьЗадачи(Объект.Ссылка, яКеш, ЭтаФорма.JQL);
	Возврат яРез;
КонецФункции

&НаКлиенте
Процедура РучнойЗапрос(Команда)
	яРез = РучнойЗапросНаСервере();
	ITC.отвВывести(яРез);
КонецПроцедуры
