
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ПланМенеджера
	Движения.ПланМенеджера.Записывать = Истина;
	Для Каждого ТекСтрокаПланПоКлиентам Из ПланПоКлиентам Цикл
		Движение = Движения.ПланМенеджера.Добавить();
		Движение.Период = Дата;
		Движение.Менеджер = Сотрудник;
		Движение.Клиент = ТекСтрокаПланПоКлиентам.Клиент;
		Движение.Задача = ТекСтрокаПланПоКлиентам.Задача;
		Движение.ПланДатаНачала = ТекСтрокаПланПоКлиентам.ПланДатаНачала;
		Движение.ПланДатаОкончания = ТекСтрокаПланПоКлиентам.ПланДатаОкончания;
		Движение.ЭЧ = ТекСтрокаПланПоКлиентам.ЭЧ;
		Движение.Вероятность = ТекСтрокаПланПоКлиентам.Вероятность;
		Движение.ЧтоНужноДляЗакрытия = ТекСтрокаПланПоКлиентам.ЧтоНужноДляЗакрытия;
		Движение.Отменен = ТекСтрокаПланПоКлиентам.Отменена;
		Движение.ПричинаОтмены = ТекСтрокаПланПоКлиентам.ПричинаОтмены;
		Движение.Сумма = ТекСтрокаПланПоКлиентам.ЭЧ * ТекСтрокаПланПоКлиентам.СтавкаЧаса;		
		Движение.СуммаБезНДС = ТекСтрокаПланПоКлиентам.ЭЧ * ТекСтрокаПланПоКлиентам.СтавкаЧасаБезНДС;		
	КонецЦикла;  
	
КонецПроцедуры
