
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//
	//ЭлементОтбора.ЛевоеЗначение		= Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("ЕстьРезультат").Поле; //Новый ПолеКомпоновкиДанных("ЕстьРезультат");
	//ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	//Элем43ентОтбора.Использование		= Истина;
	//ЭлементОтбора.ПравоеЗначение	= Ложь;
	//ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	//ЭлементОтбора.Представление		= "Есть результат";
	//ЭлементОтбора.ИдентификаторПользовательскойНастройки	= "ЕстьРезультат";
	//ЭлементОтбора.ПредставлениеПользовательскойНастройки	= "Есть результат";
	
	
КонецПроцедуры
