
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.Владелец КАК Владелец
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ФизическоеЛицо = &ФизическоеЛицо";
		Запрос.УстановитьПараметр("ФизическоеЛицо", Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Должность = "";
		Пока Результат.Следующий() Цикл
			Если ЗначениеЗаполнено(Должность) Тогда
				Должность = Должность + ", ";
			КонецЕсли;
			Должность = Должность + СокрЛП(Результат.Должность) +" в "+СокрЛП(Результат.Владелец);	
		КонецЦикла;
		ТекущееМестоРаботы = Должность;
	КонецЕсли;
		
	//_Наименование = "";
	//Если ЗначениеЗаполнено(Фамилия) Тогда
	//	_Наименование = СокрЛП(Фамилия) + " ";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Имя) Тогда
	//	_Наименование = _Наименование + СокрЛП(Имя)+ " ";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Отчество) Тогда
	//	_Наименование = _Наименование + СокрЛП(Отчество)+ " ";
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(ТекущееМестоРаботы) Тогда
	//	_Наименование = _Наименование + СокрЛП(ТекущееМестоРаботы)+ " ";
	//КонецЕсли;
	//
	//Если СтрДлина(_Наименование)>100 Тогда
	//	//Сообщить
	//КонецЕсли;
	//
	//Если Наименование <> _Наименование Тогда
	//	Наименование = _Наименование;
	//КонецЕсли;

КонецПроцедуры
