#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры
#КонецОбласти

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
КонецПроцедуры
// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
    Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
    Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.итк_Задача.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	итк_Задача.ДатаИзменения,
	|	итк_Задача.НачатьНеРанее,
	|	итк_Задача.Срок,
	|	итк_Задача.ИсторияИзменений.(
	|		НомерСтроки,
	|		Автор,
	|		ХарактерИзменений
	|	),
	|	итк_Задача.Наблюдатели.(
	|		НомерСтроки,
	|		Наблюдатель
	|	),
	|	итк_Задача.Комментарии.(
	|		НомерСтроки,
	|		Автор,
	|		Комментарий
	|	),
	|	итк_Задача.СвязанныеЗадачи.(
	|		НомерСтроки,
	|		Задача
	|	)
	|ИЗ
	|	Справочник.итк_Задача КАК итк_Задача
	|ГДЕ
	|	итк_Задача.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИсторияИзмененийШапка = Макет.ПолучитьОбласть("ИсторияИзмененийШапка");
	ОбластьИсторияИзменений = Макет.ПолучитьОбласть("ИсторияИзменений");
	ОбластьНаблюдателиШапка = Макет.ПолучитьОбласть("НаблюдателиШапка");
	ОбластьНаблюдатели = Макет.ПолучитьОбласть("Наблюдатели");
	ОбластьКомментарииШапка = Макет.ПолучитьОбласть("КомментарииШапка");
	ОбластьКомментарии = Макет.ПолучитьОбласть("Комментарии");
	ОбластьСвязанныеЗадачиШапка = Макет.ПолучитьОбласть("СвязанныеЗадачиШапка");
	ОбластьСвязанныеЗадачи = Макет.ПолучитьОбласть("СвязанныеЗадачи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьИсторияИзмененийШапка);
		ВыборкаИсторияИзменений = Выборка.ИсторияИзменений.Выбрать();
		Пока ВыборкаИсторияИзменений.Следующий() Цикл
			ОбластьИсторияИзменений.Параметры.Заполнить(ВыборкаИсторияИзменений);
			ТабДок.Вывести(ОбластьИсторияИзменений, ВыборкаИсторияИзменений.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьНаблюдателиШапка);
		ВыборкаНаблюдатели = Выборка.Наблюдатели.Выбрать();
		Пока ВыборкаНаблюдатели.Следующий() Цикл
			ОбластьНаблюдатели.Параметры.Заполнить(ВыборкаНаблюдатели);
			ТабДок.Вывести(ОбластьНаблюдатели, ВыборкаНаблюдатели.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьКомментарииШапка);
		ВыборкаКомментарии = Выборка.Комментарии.Выбрать();
		Пока ВыборкаКомментарии.Следующий() Цикл
			ОбластьКомментарии.Параметры.Заполнить(ВыборкаКомментарии);
			ТабДок.Вывести(ОбластьКомментарии, ВыборкаКомментарии.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСвязанныеЗадачиШапка);
		ВыборкаСвязанныеЗадачи = Выборка.СвязанныеЗадачи.Выбрать();
		Пока ВыборкаСвязанныеЗадачи.Следующий() Цикл
			ОбластьСвязанныеЗадачи.Параметры.Заполнить(ВыборкаСвязанныеЗадачи);
			ТабДок.Вывести(ОбластьСвязанныеЗадачи, ВыборкаСвязанныеЗадачи.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

