
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ITC_УчетВремениСервер.УстановитьСтатусДокумента(ЭтотОбъект.Ссылка, ЭтотОбъект.Статус);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Клиент = ДанныеЗаполнения.Клиент;
		Менеджер = ДанныеЗаполнения.Клиент.Менеджер;
		Статус = Справочники.ITC_СтатусыЗадач.Запросы;
				
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задача") Тогда
		яЗ = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задача.Ссылка КАК Основание,
		|	Задача.Клиент КАК Клиент,
		|	Задача.Организация КАК Организация,
		|	Задача.КонтактноеЛицо КАК КонтактноеЛицо,
		|	Задача.Описание КАК Описание,
		|	Задача.Проект КАК Проект
		|ИЗ
		|	Документ.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка");
		яЗ.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		яВ = яЗ.Выполнить().Выбрать();
		Если яВ.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, яВ);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистТребований") Тогда
		яЗ = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистТребований.Ссылка КАК Основание,
		|	ЛистТребований.Клиент КАК Клиент,
		|	ЛистТребований.Организация КАК Организация,
		|	ЛистТребований.Основание.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЛистТребований.Номер КАК Номер,
		|	ЛистТребований.Дата КАК Дата
		|ИЗ
		|	Документ.ЛистТребований КАК ЛистТребований
		|ГДЕ
		|	ЛистТребований.Ссылка = &Ссылка");
		яЗ.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		яВ = яЗ.Выполнить().Выбрать();
		Если яВ.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, яВ, ,"Номер,Дата");
			ЭтотОбъект.Тема =
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Работы по ЛТ №%1 от %2 ",
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(яВ.Номер, Истина, Истина),
			Формат(яВ.Дата, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры
// ++ БИТ МИС 05022021
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	// Вставить содержимое обработчика.
		ПолучениеНомера = Новый Запрос;
		ПолучениеНомера.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		                        |	итк_Задача.Ссылка КАК Ссылка,
		                        |	итк_Задача.НомерЗадачи КАК НомерЗадачи
		                        |ИЗ
		                        |	Справочник.итк_Задача КАК итк_Задача
		                        |ГДЕ
		                        |	итк_Задача.Родитель = &Родитель
		                        |
		                        |УПОРЯДОЧИТЬ ПО
		                        |	НомерЗадачи УБЫВ";
		ПолучениеНомера.УстановитьПараметр("Родитель",Родитель);
		Результат = ПолучениеНомера.Выполнить().Выгрузить();
		Если Результат.Количество()> 0 Тогда
		НомерЗадачи =Результат[0].НомерЗадачи + 1
	Иначе
		НомерЗадачи = 1
		КонецЕсли;
КонецПроцедуры
// -- БИТ МИС 05022021
