
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	й = 0;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	й = 0;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтроке()
	яД = Элементы.Реализация.ТекущиеДанные;
	яД.Сумма = яД.Трудозатраты * Объект.СтоимостьЧаса;
КонецПроцедуры

&НаКлиенте
Процедура РеализацияТрудозатратыПриИзменении(Элемент)
	РассчитатьСуммуВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьЧасаПриИзменении(Элемент)
	яОтвет = Вопрос("Пересчитать сумму в строках?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет, "Изменение стоимости часа");
	Если яОтвет = КодВозвратаДиалога.Да Тогда
		Для Каждого яС Из Объект.Реализация Цикл
			Если яС.Трудозатраты > 0 Тогда
				яС.Сумма = яС.Трудозатраты * Объект.СтоимостьЧаса;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИмяФайла(Команда)
	яО = ITC_ФайлыКлиент.ПолучитьИмяФайла(Объект.Ссылка);
	Если яО.Успех Тогда
		ВывестиВБуферОбмена(яО.Данные);
	Иначе
		ITC.Ответ_ВывестиСообщенияПользователю(яО);
	КонецЕсли;
КонецПроцедуры