
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ПланСотрудника
	Движения.ПланСотрудника.Записывать = Истина;
	Для Каждого ТекСтрокаПланПоКлиентам Из ПланПоКлиентам Цикл
		Движение = Движения.ПланСотрудника.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Клиент = ТекСтрокаПланПоКлиентам.Клиент;
		Движение.Задача = ТекСтрокаПланПоКлиентам.Задача;
		Движение.ПланДатаНачала = ТекСтрокаПланПоКлиентам.ПланДатаНачала;
		Движение.ПланДатаОкончания = ТекСтрокаПланПоКлиентам.ПланДатаОкончания;
		Движение.ЭЧ = ТекСтрокаПланПоКлиентам.ЭЧ;
		Движение.Менеджер = ТекСтрокаПланПоКлиентам.Менеджер;
		Движение.Вероятность = ТекСтрокаПланПоКлиентам.Вероятность;
		Движение.ЧтоНужноДляЗакрытия = ТекСтрокаПланПоКлиентам.ЧтоНужноДляЗакрытия;
		Движение.Отменен = ТекСтрокаПланПоКлиентам.Отменена;
		Движение.ПричинаОтмены = ТекСтрокаПланПоКлиентам.ПричинаОтмены;
		Движение.Сумма = ТекСтрокаПланПоКлиентам.ЭЧ*ТекСтрокаПланПоКлиентам.СтавкаЧаса;
		Движение.СуммаБезНДС = ТекСтрокаПланПоКлиентам.ЭЧ*ТекСтрокаПланПоКлиентам.СтавкаЧасаБезНДС;
	КонецЦикла;  
	
	// регистр сведений  УчетСертефикации
	ТаблицаСертефикации = Новый ТаблицаЗначений;
	ТаблицаСертефикации.Колонки.Добавить("Компетенция",Новый ОписаниеТипов("СправочникСсылка.Компетенции"));
	ТаблицаСертефикации.Колонки.Добавить("ТипКомпетенции",Новый ОписаниеТипов("ПеречислениеСсылка.ТипКомпетенции"));
	ТаблицаСертефикации.Колонки.Добавить("План",Новый ОписаниеТипов("Дата"));
	ТаблицаСертефикации.Колонки.Добавить("Факт",Новый ОписаниеТипов("Дата"));
	
	Для Каждого стр из ПланСертификации ЦИКЛ
		Если стр.Проф = Ложь 
			тогда
			Если стр.ПрофПлан <> Дата(1,1,1) или стр.ПрофФакт <> Дата(1,1,1)
				тогда ъЗапись = ТаблицаСертефикации.Добавить();
				ъЗапись.Компетенция = стр.Компетенция;
				ъЗапись.ТипКомпетенции = Перечисления.ТипКомпетенции.ПРОФ;
				ъЗапись.План  =Стр.ПрофПлан ;
				ъЗапись.Факт   = Стр.ПрофФакт ;
			КонецЕсли;
			КонецЕсли;
		Если стр.СК = Ложь
			тогда 
			Если стр.СКПлан <> Дата(1,1,1) или стр.СКФакт <> Дата(1,1,1)
				тогда ъЗапись = ТаблицаСертефикации.Добавить();
				ъЗапись.Компетенция = стр.Компетенция;
				ъЗапись.ТипКомпетенции = Перечисления.ТипКомпетенции.СК;
				ъЗапись.План  =Стр.СКПлан ;
				ъЗапись.Факт  = Стр.СКФакт ;
			КонецЕсли;
			КонецЕсли;
		Если стр.Спец = Ложь
			тогда 
			Если стр.СпецПлан <> Дата(1,1,1) или стр.СпецФакт <> Дата(1,1,1)
				тогда ъЗапись = ТаблицаСертефикации.Добавить();
				ъЗапись.Компетенция = стр.Компетенция;
				ъЗапись.ТипКомпетенции = Перечисления.ТипКомпетенции.СПЕЦ;
				ъЗапись.План  =Стр.СпецПлан ;
				ъЗапись.Факт  = Стр.СпецФакт ;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Для каждого Эл из ТаблицаСертефикации Цикл
		МенеджерЗаписи = РегистрыСведений.УчетСертефикации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Компетенция = Эл.Компетенция;
		МенеджерЗаписи.Сотрудник = Сотрудник.Ссылка;
		МенеджерЗаписи.ТипКомпетенции = Эл.ТипКомпетенции;
		МенеджерЗаписи.ДатаПлан = Эл.План;
		МенеджерЗаписи.ДатаФакт = Эл.Факт;
		МенеджерЗаписи.Записать();	
	КонецЦикла;
КонецПроцедуры
