&НаКлиенте
Процедура ОбновитьВремяПоСтроке(Элемент)
	ТекущаяСтрока = Элементы.РабочееВремя.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Начало) или НЕ ЗначениеЗаполнено(ТекущаяСтрока.Конец) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Длительность = (ТекущаяСтрока.Конец - ТекущаяСтрока.Начало)/3600;
	//ТекущаяСтрока.ЧасыВОтчет = ТекущаяСтрока.Длительность;
КонецПроцедуры

&НаКлиенте
Процедура РабочееВремяНачалоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьВремяПоСтроке(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РабочееВремяКонецПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьВремяПоСтроке(Элемент)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  // ++ БИТ МИС 08042021
	Если Параметры.Ключ.Пустая() тогда
		Объект.Пользователь =Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	// -- БИТ МИС
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если Объект.Дата < НачалоДня(ТекущаяДата()) и
	(Дата(ТекущаяДата()) -КонецДня(Объект.Дата))>=43202
	Тогда 
	Объект.Дата = ТекущаяДата();
	Сообщить("Запрещенно создавать отчет задним числом или за прошлый день после 12:00 текущего дня");
	КонецЕсли;
КонецПроцедуры
