
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПриЧтенииНаСервере();
	ЗаполнитьКатегориюСотрудника();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере()
	
	СотрудникСсылка = Объект.Ссылка;
	
КонецПроцедуры

Процедура ЗаполнитьКатегориюСотрудника()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииСотрудниковСрезПоследних.Категория КАК Категория
		|ИЗ
		|	РегистрСведений.КатегорииСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК КатегорииСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Сотрудник", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Категория = Выборка.Категория;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКатегорию(Команда)
	
	СотрудникиКлиент.ОформитьНаОсновании(ЭтотОбъект, СотрудникСсылка, "Документы.НазначениеКатегорийСотрудников");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СотрудникСсылка = Объект.Ссылка;

КонецПроцедуры
// ++ БИТ МИС 09022021
&НаСервере
Процедура ПользовательПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	Если НЕ Объект.Пользователь = Справочники.Пользователи.ПустаяСсылка()
		тогда 
		ъЗначениеРеквизитов =ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Пользователь,"Наименование,итк_Подразделение"); 
		Объект.Наименование =ъЗначениеРеквизитов.Наименование;
		Объект.Подразделение = ъЗначениеРеквизитов.итк_Подразделение;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательПриИзмененииНаСервере();
КонецПроцедуры
// -- БИТ МИС 09022021