
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//МассивБаз = ПолучитьБазыПоЗадаче(ПараметрКоманды);
	
	Парам = Новый Структура("Задача",ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.РаботаСГит",Парам,,ПараметрКоманды);
	
КонецПроцедуры

// Получает массив баз, связанных с задачей.
//
// Параметры:
//  Задача  - СправочникСсылка.ITC_Задача - Задача, по которой нужно получить массив баз
//
// Возвращаемое значение:
//   Массив   - Массив баз, связанных с задачей
//
&НаСервере
Функция ПолучитьБазыПоЗадаче(Задача)

	Возврат РегистрыСведений.БазыПоЗадачам.ПолучитьБазыПоЗадаче(Задача);	

КонецФункции // ПолучитьБазыПоЗадаче()

