
Функция СписокКлиентовПолучить(Запрос)
	яОтвет = Новый HTTPСервисОтвет(200);
	ITC_HTTPСервер.ДобавитьЗаголовкиОтвета(яОтвет);

	яКлюч = "0rjjCGbHLqP0OaaZeEApD6w";
	
	яИД = Запрос.ПараметрыURL["id"];
	Если яИД <> яКлюч Тогда
		яОтвет.УстановитьТелоИзСтроки("<html><body><h1>IT works well!</h1></body></html>", КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат яОтвет;
	КонецЕсли;
	
	яТело = "<html>";
	ITC_HTTPСервер.ДобавитьТаблицуСтилей(яТело);
	ITC_HTTPСервер.ДобавитьЗаголовкиHead(яТело, "ITCrowd");
	яТело = яТело + "<body><h2>IT works perfect!</h2>";
//	|<meta http-equiv=""Cache-Control"" content=""no-cache"">
	
	яСайт="https://wiki.upra.tk/itc/hs/itc_gci/";
	яКлиент = Запрос.ПараметрыЗапроса.Получить("p");
	
	яН = "<tr><td>";
	яС = "</td><td>";
	яК = "</td></tr>";
	
	Если яКлиент = Неопределено Тогда
		яЗ = Новый Запрос(
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК С,
		|	Клиенты.Наименование КАК Им
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Им");
		яВ = яЗ.Выполнить().Выбрать();
		
		яСтрока = "<a href=""" + яСайт + яКлюч + "?p=";
		яСтрока = "<a href=""?p=";
		яТело = яТело + "<table class=""blueTable""><thead>
		|<tr><th>Наименование</th></tr>
		|</thead><tbody>";
		Пока яВ.Следующий() Цикл
			яТело = яТело + яН + яСтрока + Строка(яВ.С.УникальныйИдентификатор()) + """>" + яВ.Им + "</a>" + яК;
		КонецЦикла;
		яТело = яТело + "</tbody></table>";
	Иначе
		яСсылка = Справочники.Клиенты.ПолучитьСсылку(Новый УникальныйИдентификатор(яКлиент));
		яЗ = Новый Запрос(
		"ВЫБРАТЬ
		|	ПКК.Название КАК Н,
		|	ПКК.ВидПодключения.Наименование КАК ВП,
		|	ПКК.Адрес КАК А,
		|	ПКК.Логин КАК Л,
		|	ПКК.Пароль КАК П
		|ИЗ
		|	РегистрСведений.ПодключенияККлиенту КАК ПКК
		|ГДЕ
		|	ПКК.Клиент = &К
		|
		|УПОРЯДОЧИТЬ ПО
		|	Н");
		яЗ.УстановитьПараметр("К", яСсылка);
		
		яВ = яЗ.Выполнить().Выбрать();
		
		яНазад = "<a href=""" + яСайт + яКлюч + """>Назад</a>";
		яНазад = "<a href=""?"">Назад</a>";

		
		яТело = яТело + яНазад + "<h3>" + яСсылка + "</h3><table class=""blueTable""><thead>
		|<tr><th>Имя</th><th>Вид</th><th>Адрес</th><th>Логин</th><th>Пасс</th></tr>
		|</thead><tbody>";
		Пока яВ.Следующий() Цикл
			яТело = яТело + яН + яВ.Н + яС + яВ.ВП + яС + яВ.А + яС + яВ.Л + яС + яВ.П + яК;
		КонецЦикла;
		яТело = яТело + "</tbody></table>" + яНазад;
	КонецЕсли;
	
	
	яТело = яТело + "</body></html>";
	яОтвет.УстановитьТелоИзСтроки(яТело, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат яОтвет;
КонецФункции



