
Функция ОсновнойПолучитьФорму(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "text/html; charset=utf-8");
	
	яМакет = ПолучитьОбщийМакет("МакетПокер").ПолучитьТекст();
	
	яНомер = Запрос.ПараметрыЗапроса.Получить("id");
	яПользователь = Запрос.ПараметрыЗапроса.Получить("name");
    яОценка = Запрос.ПараметрыЗапроса.Получить("result");
	
	Если ЗначениеЗаполнено(яНомер) Тогда
		яМакет = СтрЗаменить(яМакет, "ticket_id", яНомер);
	КонецЕсли;		
		
	Если ЗначениеЗаполнено(яПользователь) И ЗначениеЗаполнено(яОценка) Тогда

		яЗадача = Справочники.итк_Задача.НайтиПоРеквизиту("JIRA", яНомер);
		Если ЗначениеЗаполнено(яЗадача) Тогда
			яМЗ = РегистрыСведений.итк_ОценкиПоЗадаче.СоздатьМенеджерЗаписи();
			яМЗ.Задача = яЗадача;
			яМЗ.Оценка = яОценка;
			яМЗ.Пользователь = яПользователь;
			яМЗ.Записать(Истина);
		КонецЕсли;
		
	КонецЕсли;

	Ответ.УстановитьТелоИзСтроки(яМакет);
	Возврат Ответ;
КонецФункции
