
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	яЛогоПасс = Новый Структура("Логин,Пароль");
	ЗаполнитьЗначенияСвойств(яЛогоПасс, ЭтаФорма);
	яХранЛП = Новый ХранилищеЗначения(яЛогоПасс);
	ТекущийОбъект.ЛогинПароль = яХранЛП;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	яЛогоПасс = РеквизитФормыВЗначение("Объект").ЛогинПароль.Получить();
	Если ТипЗнч(яЛогоПасс) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, яЛогоПасс);
	КонецЕсли;
КонецПроцедуры
