// Получает массив баз, связанных с выбранной задачей
//
// Параметры:
//  Задача  - СправочникСсылка.ITC_Задача - Задача, по которой нужно получить базы
//
// Возвращаемое значение:
//   Массив   - Массив
//
Функция ПолучитьБазыПоЗадаче(Задача) Экспорт

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БазыПоЗадачам.База КАК База
		|ИЗ
		|	РегистрСведений.БазыПоЗадачам КАК БазыПоЗадачам
		|ГДЕ
		|	БазыПоЗадачам.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат.Добавить(ВыборкаДетальныеЗаписи.База);
		КонецЦикла;
	
	КонецЕсли;

    Возврат Результат;
КонецФункции // ПолучитьБазыПоЗадаче()

	  