
&НаСервере
Функция ЗаписатьНаряд()
	НарядОбъект = Документы.РегистрацияВремени.СоздатьДокумент();
	НарядОбъект.Дата = НачалоДня(ПланДатаНачала);
	НарядОбъект.ПланДатаНачала = ПланДатаНачала;
	НарядОбъект.ПланДатаОкончания = ПланДатаКонец;
	НарядОбъект.ДокументОснование = Задача;
	НарядОбъект.Описание = ЧтоСделать;
	НарядОбъект.Адрес = Адрес;
	НарядОбъект.НаВыезде = ЭтоВыезд;
	НарядОбъект.Ответственный = Ответственный;
	
	НарядОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НарядОбъект.Ссылка;
	
КонецФункции


&НаКлиенте
Процедура Записать(Команда)
	// Вставить содержимое обработчика.
	
	Наряд = ЗаписатьНаряд();
	ОповеститьОВыборе(Наряд);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Параметры.Свойство("Задача", Задача);
	Параметры.Свойство("Начало", ПланДатаНачала);
	Параметры.Свойство("Конец", ПланДатаКонец);
	Параметры.Свойство("Ответственный", Ответственный);

	
КонецПроцедуры


