#Область ПрограммныйИнтерфейс
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры
#КонецОбласти

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Клиент");
	Поля.Добавить("Тема");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Представление = "["+СокрЛП(Данные.Клиент)+"] "+СокрЛП(Данные.Тема) + " от " + Формат(Данные.Дата, "ДФ=yyyy-MM-dd") + " №" + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры



