Функция СгенерироватьПароль(ъДлина, ъАнгл, ъЧисла, ъРегистр, ъЗнаки, ъДопСимволы) Экспорт
	
	//инициализация строки символов
	яАнгл = "abcdefghijklmnopqrstuvwxyz";
	яЧисла = "0123456789";
	яЗнаки = "-_+=<>,./?\|!@#$%^&*();:`~[]{}";
	яСимволы = "" + ?(ъАнгл, яАнгл, "")	 + ?(ъЧисла, яЧисла, "") + ?(ъАнгл и ъРегистр, ВРег(яАнгл), "") + ?(ъЗнаки, яЗнаки, "") + ъДопСимволы;
	Если ПустаяСтрока(яСимволы) Тогда
		Возврат "";
	КонецЕсли;
	
	//инициализация генератора случайных чисел
	яСЧ = 0;
	яДата = ТекущаяДата();
	Пока ТекущаяДата() = яДата Цикл
		яСЧ = яСЧ + 1;
	КонецЦикла;
	яСЧ = яСЧ + Год(яДата) * Час(яДата) * Месяц(яДата) * ДеньНедели(яДата) * Секунда(яДата) * Минута(яДата);
	яГ = Новый ГенераторСлучайныхЧисел(яСЧ);
	
	//Перемешивание символов
	яБуф = "";
	яД = СтрДлина(яСимволы);
	Пока яД > 0 Цикл
		яСЧ = яГ.СлучайноеЧисло(1, яД);
		яБуф = яБуф + Сред(яСимволы, яСЧ, 1);
		яСимволы = Лев(яСимволы, яСЧ - 1) + Сред(яСимволы, яСЧ + 1);
		яД = яД - 1;
	КонецЦикла;
	яСимволы = яБуф;
	
	//Собственно генерация пароля
	яДлина = СтрДлина(яСимволы);
	яР = "";
	Для й = 1 По ъДлина	Цикл
		яСЧ = яГ.СлучайноеЧисло(1, яДлина);
		яР = яР + Сред(яСимволы, яСЧ, 1);
	КонецЦикла;
	
	
	Возврат яР;
	
КонецФункции