


Процедура ОбработкаПроведения(Отказ, Режим)
	
	
//<<Ермеев проверка на созаданный ранее документ на этой неделе

	ТекущаяНеделя = НеделяГода(ТекущаяДата()); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпринтыПоСделкамСрезПоследних.Ответственный КАК Ответственный,
		|	НЕДЕЛЯ(СпринтыПоСделкамСрезПоследних.Регистратор.Дата) КАК Неделя
		|ИЗ
		|	РегистрСведений.СпринтыПоСделкам.СрезПоследних(, НЕДЕЛЯ(Регистратор.Дата) = &Неделя) КАК СпринтыПоСделкамСрезПоследних
		|ГДЕ
		|	СпринтыПоСделкамСрезПоследних.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Неделя", ТекущаяНеделя);
	ЗАпрос.УстановитьПараметр("Ответственный",Ответственный);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой()  Тогда
		Сообщить("На этой неделе менеджер "  + Ответственный + " уже создавал документ!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
//>>

	
	
//<<Ермеев запись в регистр сведений
		Движения.СпринтыПоСделкам.Записывать = Истина;
	Для Каждого ТекСтрокаСоставСпринта Из СоставСпринта Цикл
		Движение = Движения.СпринтыПоСделкам.Добавить();
		Движение.Период = Дата;
		Движение.ДатаЗавершенияСпринта = ДатаЗавершенияСпринта;
		Движение.Сделка = ТекСтрокаСоставСпринта.Сделка;
		Движение.Клиент = ТекСтрокаСоставСпринта.Клиент;
		Движение.Ответственный = Ответственный;
		
		Если ТекСтрокаСоставСпринта.ФактическийСтатус.Пустая() Тогда
			Движение.ФактическийСтатус = ТекСтрокаСоставСпринта.ФактическийСтатус;
			Движение.ТекущийСтатус = ТекСтрокаСоставСпринта.ТекущийСтатус;
			Движение.НовыйСтатус = ТекСтрокаСоставСпринта.НовыйСтатус;
			Движение.Сделали = ТекСтрокаСоставСпринта.Сделали;
			Движение.ПланНаНеделю = ТекСтрокаСоставСпринта.ПланНаНеделю;
			Движение.ФактПоИтогамНедели = ТекСтрокаСоставСпринта.ФактПоИтогамНедели;
			Движение.ПолучилиЖелаемыйРезультат = ТекСтрокаСоставСпринта.ПолучилиЖелаемыйРезультат;
			Движение.Выводы = ТекСтрокаСоставСпринта.Выводы;	
		Иначе
			Движение.ТекущийСтатус = ТекСтрокаСоставСпринта.ФактическийСтатус;
			Движение.ФактическийСтатус = "";
			Движение.НовыйСтатус = "";
			Движение.Сделали = "";
			Движение.ПланНаНеделю = "" ;
			Движение.ФактПоИтогамНедели = "";
			Движение.ПолучилиЖелаемыйРезультат = "" ;
			Движение.Выводы = "";
		КонецЕсли
		
	КонецЦикла;
//>>
	КонецПроцедуры
