
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	ITC_УчетВремениСервер.УстановитьСтатусДокумента(ЭтотОбъект.Ссылка, ЭтотОбъект.Статус);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задача") Тогда
		яЗ = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задача.Ссылка КАК Основание,
		|	Задача.Клиент КАК Клиент,
		|	Задача.Организация КАК Организация,
		|	Задача.КонтактноеЛицо КАК КонтактноеЛицо,
		|	Задача.Описание КАК Описание,
		|	Задача.Проект КАК Проект
		|ИЗ
		|	Документ.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка");
		яЗ.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		яВ = яЗ.Выполнить().Выбрать();
		Если яВ.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, яВ);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистТребований") Тогда
		яЗ = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистТребований.Ссылка КАК Основание,
		|	ЛистТребований.Клиент КАК Клиент,
		|	ЛистТребований.Организация КАК Организация,
		|	ЛистТребований.Основание.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЛистТребований.Номер КАК Номер,
		|	ЛистТребований.Дата КАК Дата
		|ИЗ
		|	Документ.ЛистТребований КАК ЛистТребований
		|ГДЕ
		|	ЛистТребований.Ссылка = &Ссылка");
		яЗ.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		яВ = яЗ.Выполнить().Выбрать();
		Если яВ.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, яВ, ,"Номер,Дата");
			ЭтотОбъект.Тема =
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Работы по ЛТ №%1 от %2 ",
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(яВ.Номер, Истина, Истина),
			Формат(яВ.Дата, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//++Кондаков
	//Закоментировал этот код так каак вообще не ясно какую проблему он решает (И тем более в модуле объекта)
	
	//ЗапросСтатус=новый запрос(
	//"ВЫБРАТЬ
	//|	СтатусыДокументов.ЕстьРезультат КАК ЕстьРезультат
	//|ИЗ
	//|	Справочник.СтатусыДокументов КАК СтатусыДокументов
	//|ГДЕ
	//|	СтатусыДокументов.Ссылка = &Статус
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Клиенты.ТребуетсяУказаниеКонтактногоЛица КАК ТребуетсяУказаниеКонтактногоЛица
	//|ИЗ
	//|	Справочник.Клиенты КАК Клиенты
	//|ГДЕ
	//|	Клиенты.Ссылка = &Клиент");
	//ЗапросСтатус.УстановитьПараметр("Статус",  ЭтотОбъект.Статус);
	//ЗапросСтатус.УстановитьПараметр("Клиент",  ЭтотОбъект.Клиент);
	//яРезультатПакета = ЗапросСтатус.ВыполнитьПакет();
	//яКоличествоВПакете = яРезультатПакета.Количество();
	//Выборка = яРезультатПакета[яКоличествоВПакете-2].Выбрать();
	//яВыборкаКлиент = яРезультатПакета[яКоличествоВПакете-1].Выбрать();
	//Если Выборка.Следующий() И Выборка.ЕстьРезультат = Истина Тогда
	//	Если Не ЗначениеЗаполнено(ЭтотОбъект.Отчет)  Тогда
	//		отказ=истина;
	//		яСообщение = Новый СообщениеПользователю;
	//		яСообщение.Текст = "Поле ""Отчет"" не заполнено!";
	//		//яообщСообщение.Поле = "Отчет";
	//		//яСение.УстановитьДанные(ЭтотОбъект);
	//		яСообщение.Сообщить();
	//	КонецЕсли;
	//КонецЕсли;
	//Если яВыборкаКлиент.Следующий()
	//	И яВыборкаКлиент.ТребуетсяУказаниеКонтактногоЛица
	//	И Не ЗначениеЗаполнено(ЭтотОбъект.КонтактноеЛицо) Тогда
	//	Отказ = Истина;
	//	яСообщение = Новый СообщениеПользователю;
	//	яСообщение.Текст = "Не заполнено поле ""Контактное лицо""!";
	//	яСообщение.Поле = "КонтактноеЛицо";
	//	яСообщение.УстановитьДанные(ЭтотОбъект);
	//	яСообщение.Сообщить();
	//КонецЕсли;	
	
КонецПроцедуры
