


&НаКлиенте
Процедура Подключиться(Команда)
	
	яТД = Элементы.Список.ТекущиеДанные;
	яР = ITC_ПодключенияКлиент.ПодключитьсяККлиенту(яТД.Клиент, яТД.Название, яТД.ВидПодключения);
	Если Не яР.Успех Тогда
		Сообщить(яР.Сообщение);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодключитьсяFullHD(Команда)
	
	яРазрешениеЭкрана = "
	|desktopwidth:i:1920
	|desktopheight:i:1080";
	яТД = Элементы.Список.ТекущиеДанные;
	яР = ITC_ПодключенияКлиент.ПодключитьсяККлиенту(яТД.Клиент, яТД.Название, яТД.ВидПодключения, яРазрешениеЭкрана);
	Если Не яР.Успех Тогда
		Сообщить(яР.Сообщение);
	КонецЕсли;
	
КонецПроцедуры
