


#Если Клиент Тогда
	
Процедура ВывестиВБуферОбмена(ъТекст) Экспорт
	
	яХТМЛ = Новый COMОбъект("htmlfile");
	яХТМЛ.ParentWindow.ClipboardData.Setdata("Text", ъТекст);
	яХТМЛ = Неопределено;
		
КонецПроцедуры

#КонецЕсли


// Процедура - Инкремент переменной
//
// Параметры:
//  ъЧто - Число	 - Что инкрементировать
//
Процедура глИнк(ъЧто) Экспорт
	ъЧто = ъЧто + 1;
КонецПроцедуры

Процедура глДобавить(ъКуда, ъЧто) Экспорт
	ъКуда = ъКуда + ъЧто;
КонецПроцедуры

Процедура глОкруглитьДоБольшегоЦелогоПоМодулю(ъЧисло) Экспорт
	яОст = ъЧисло % 1;
	ъЧисло = ъЧисло - яОст + ?(ъЧисло < 0, - 1, 1);
КонецПроцедуры

