// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		Если Параметры.Свойство("РабочееВремяЧасы") Тогда
			яЗ = Новый Запрос(
			"ВЫБРАТЬ
			|	РАЗНОСТЬДАТ(&ДатаНоль, &ДатаТек, МИНУТА) КАК Минуты");
			яЗ.УстановитьПараметр("ДатаНоль",	Дата("00010101000000"));
			яЗ.УстановитьПараметр("ДатаТек",	Параметры.РабочееВремяЧасы);
			яВ = яЗ.Выполнить().Выбрать();
			яВ.Следующий();
			яЧ = Окр(яВ.Минуты / 60, 2, РежимОкругления.Окр15как20);
			яС = Объект.РабочееВремя.Добавить();
			яС.Дата = ТекущаяДата();
			яС.Факт = яЧ;
			яС.Отчет = яС.Факт;
		ИначеЕсли Параметры.Свойство("РабочееВремяСписок") Тогда
			яТЗ = Новый ТаблицаЗначений();
			яТипДатыВремя = Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
			яТЗ.Колонки.Добавить("Дата", яТипДатыВремя);
			яТЗ.Колонки.Добавить("ДатаКонец", яТипДатыВремя);
			яТипСтрока256 = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(256, ДопустимаяДлина.Переменная));
			яТЗ.Колонки.Добавить("Комментарий", яТипСтрока256);
			Для Каждого яС Из Параметры.РабочееВремяСписок Цикл
				яСтр = яТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(яСтр, яС);
			КонецЦикла;
			
			яЗ = Новый Запрос(
			"ВЫБРАТЬ
			|	ТЗ.Дата,
			|	ТЗ.ДатаКонец,
			|	ТЗ.Комментарий
			|ПОМЕСТИТЬ втТЗ
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втТЗ.Дата КАК Дата,
			|	РАЗНОСТЬДАТ(втТЗ.Дата, втТЗ.ДатаКонец, СЕКУНДА) / 3600 КАК Факт,
			|	втТЗ.Комментарий
			|ПОМЕСТИТЬ втРасчеты
			|ИЗ
			|	втТЗ КАК втТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втРасчеты.Дата,
			|	втРасчеты.Факт,
			|	втРасчеты.Комментарий
			|ИЗ
			|	втРасчеты КАК втРасчеты");
			яЗ.УстановитьПараметр("ТЗ", яТЗ);
			
			Объект.РабочееВремя.Загрузить(яЗ.Выполнить().Выгрузить());
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		
	КонецЕсли;
	
	ЗаполнениеДанныхДляПросмотра();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура РабочееВремяФактПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Элементы.РабочееВремя.ТекущиеДанные.Отчет) Тогда
		Элементы.РабочееВремя.ТекущиеДанные.Отчет = Элементы.РабочееВремя.ТекущиеДанные.Факт;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ЗаполнениеДанныхДляПросмотра_Документ();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДанныхДляПросмотра()
	ЗаполнениеДанныхДляПросмотра_Документ();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДанныхДляПросмотра_Документ()
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		яЗапрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задача.Клиент КАК Клиент
		|ИЗ
		|	Документ.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка");
		яЗапрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
		яВыборкаДокумент = яЗапрос.Выполнить().Выбрать();
		Если яВыборкаДокумент.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, яВыборкаДокумент);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.Клиент = Справочники.Клиенты.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтчетПоФакту(Команда)
	яКоэффициент = 1;
	Если ВвестиЧисло(яКоэффициент, "Укажите коэффициент учёта времени (для выходных и праздничных дней он выше).", 6,5) Тогда
		Для Каждого яС Из Объект.РабочееВремя Цикл
			яС.Отчет = яС.Факт * яКоэффициент;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ПериодЧасыМинутыСекунды(Знач КоличествоСекунд)
	
	Перем Часы, Минуты, Секунды;
	
	//получаем часы
	Часы = Цел(КоличествоСекунд / 3600);
	//считаем остаток
	КоличествоСекунд = КоличествоСекунд % 3600;
	//получаем минуты
	Минуты = Цел(КоличествоСекунд / 60);//в минуте 60 сек
	//остались секунды
	Секунды = КоличествоСекунд % 60;
	
	Возврат Часы + Минуты/60;
	
КонецФункции

