
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задача") Тогда
		яЗ = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Задача.Ссылка КАК Основание,
		|	Задача.Клиент,
		|	Задача.Организация
		|ИЗ
		|	Документ.Задача КАК Задача
		|ГДЕ
		|	Задача.Ссылка = &Ссылка");
		яЗ.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		яВ = яЗ.Выполнить().Выбрать();
		Если яВ.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, яВ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
