
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//создадим пустой документ
	яРез = ОбработкаКоманды_Сервер();
	Если яРез.Успех Тогда
		//откроем форму документа
		ПараметрыФормы = Новый Структура("Ключ", яРез.Ссылка);
		//яФ = ОткрытьФорму("Документ.Задача.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		яФ = ОткрытьФорму("Справочник.итк_Задача.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);		
		//запустим таймер сразу
		ITC_ТаймерКлиент.ЗапуститьТаймер(яРез.Ссылка, яФ);
	Иначе
		ITC.Ответ_ВывестиСообщенияПользователю(яРез);
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Функция ОбработкаКоманды_Сервер()
	яО = ITC.Ответ_СформироватьСтруктуру("Ссылка");
	
	Попытка
		//яДок = Документы.Задача.СоздатьДокумент();
		//яДок.Дата = ТекущаяДата();
		//яДок.Статус = Справочники.СтатусыДокументов.Новый;
		//яДок.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		//яДок.Записать(РежимЗаписиДокумента.Запись);
		ЗадачаСпр = Справочники.итк_Задача.СоздатьЭлемент();
		ЗадачаСпр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ЗадачаСпр.Автор = ПараметрыСеанса.ТекущийПользователь;		
		ЗадачаСпр.ДатаСоздания = ТекущаяДата();
		ЗадачаСпр.Статус = Справочники.ITC_СтатусыЗадач.Запросы;
		ЗадачаСпр.Записать();
		яО.Ссылка = ЗадачаСпр.Ссылка;
	Исключение
		ITC.Ответ_УстановитьСтатус(яО, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат яО;
КонецФункции