// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		// ++ БИТ МИС 03022021
		Объект.Ответственный = ПараметрыСеанса.ТекущийВнешнийПользователь;
		Объект.ПризнакЗадачи = Перечисления.ПризнакЗадачи.ВыполнениеРабот;
		Объект.НомерЗадачи = 0;
		// ++ БИТ МИС 03022021
		Объект.ДатаСоздания = ТекущаяДата();
		Объект.ОбъектМетаданных = Справочники.ОбъектыМетаданных.Нет;
	КонецЕсли;
	Наряды.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Объект.Ссылка);
	ВидимостьПоляОтчет();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

// ++ БИТ МИС 03022021
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = "Сотрудник" Тогда
		ъПарам = Новый Структура;
		ъПарам.Вставить("РежимВыбора",Истина);
		Форма = ПолучитьФорму("Справочник.Пользователи.ФормаВыбора",ъПарам,ЭтаФорма.Элементы.Согласовант);	
		Форма.Открыть();
	ИначеЕсли Результат = "Клиент"  Тогда
		ъПарам = Новый Структура;
		ъПарам.Вставить("Владелец",Объект.Клиент);
		ъПарФормы = Новый Структура;
		ъПарФормы.Вставить("Отбор",ъПарам);
		Форма = ПолучитьФорму("Справочник.КонтактныеЛица.ФормаВыбора",ъПарФормы,ЭтаФорма.Элементы.Согласовант);	
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СогласовантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Сотрудник");
	Кнопки.Добавить("Клиент");
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);	
	ПоказатьВопрос(Оповещение,
	"Кто будет принимать работы по задаче?",
	Кнопки,
	0,,"Вопрос",);
КонецПроцедуры
&НаСервере
Процедура ВидимостьПоляОтчет ()
	Если Объект.ПризнакЗадачи = Перечисления.ПризнакЗадачи.ВыполнениеРабот 
		Тогда ЭтаФорма.Элементы.Отчет.Видимость = Истина
	Иначе
		ЭтаФорма.Элементы.Отчет.Видимость = Ложь
		КонецЕсли;

	КонецПроцедуры

&НаКлиенте
Процедура ГиперНаряды(Команда)
	 ъПарам = Новый Структура;
		ъПарам.Вставить("ДокументОснование",Объект.Ссылка);
		ъПарФормы = Новый Структура;
		ъПарФормы.Вставить("Отбор",ъПарам);
		Форма = ПолучитьФорму("Документ.Наряд.ФормаСписка",ъПарФормы,ЭтаФорма,,ЭтаФорма.Окно);	
		Форма.Открыть();

КонецПроцедуры


&НаКлиенте
Процедура ПризнакЗадачиПриИзменении(Элемент)
	ВидимостьПоляОтчет ();
КонецПроцедуры

// -- БИТ МИС 03022021


#Область Скрам_оценка

&НаСервере
Процедура ОценитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Оценить(Команда)
	ОценитьНаСервере();
КонецПроцедуры

#КонецОбласти