// <Описание функции>
//
// Параметры:
//  СтрокаЗапуска  - Строка - строка запуска скрипта
//  СостояниеОкна  - Число - Вариант запуска окна:
//                 0 - скрывает окно, будет виден только процесс в диспетчере задач
//                 1 – нормальный режим
//                 2 – свернутый вид
//                 3 – развернутый вид
//                 По умолчанию 0.
//  ЖдатьЗавершения  - Булево - Требуется ли ждать завершения процесса.
//                 По умолчанию Истина
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ВыполнитьСкрипт(СтрокаЗапуска, ТекущаяПапка = "", СостояниеОкна = 0, ЖдатьЗавершения = Истина) Экспорт
	КодВозврата = 1;
	Попытка
		Оболочка = Новый COMОбъект("WScript.Shell");
		Если Не ПустаяСтрока(ТекущаяПапка) Тогда
			Оболочка.CurrentDirectory = ТекущаяПапка;
		КонецЕсли;
		КодВозврата = Оболочка.Run(СтрокаЗапуска, СостояниеОкна, ЖдатьЗавершения);
	Исключение
		ИмяСобытия = "ВыполнениеСкриптаWScript";
		ПредставлениеУровня = "Ошибка";
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, ПредставлениеУровня, Комментарий,,Истина);
	КонецПопытки;
	Оболочка = Неопределено;
	Возврат КодВозврата;
	
КонецФункции // ВыполнитьСкрипт()
