
&НаКлиенте
Процедура АдресЛокальногоРепозиторияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)   //#DIP-64  КурцовАИ 2022.09.30
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = Объект.АдресЛокальногоРепозитория; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог локального репозитория базы"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		Объект.АдресЛокальногоРепозитория = ДиалогОткрытия.Каталог;   
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
 Процедура АдресПриИзменении(Элемент)
	 ЗаполнитьАдресПодключения();
 КонецПроцедуры

&НаКлиенте
 Процедура СерверПриИзменении(Элемент)
	 ЗаполнитьАдресПодключения();
 КонецПроцедуры
 
&НаКлиенте
Процедура СтрокаПодключенияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.СтрокаПодключения) Тогда
		ПодключениеБазыУникально = ПодключениеБазыУникально(Объект.СтрокаПодключения);  
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Если ЗначениеЗаполнено(Объект.СтрокаПодключения) Тогда
	   Отказ = Не ПодключениеБазыУникально(Объект.СтрокаПодключения);
	КонецЕсли;
КонецПроцедуры

 
&НаКлиенте
Процедура ЗаполнитьАдресПодключения()
	
	Если ЗначениеЗаполнено(Объект.Адрес) и ЗначениеЗаполнено(Объект.Сервер) Тогда
		Если СтрНайти(Объект.Адрес,":") Тогда  // в адресе файловой базы должно быть :
			Объект.СтрокаПодключения = Объект.Адрес;		 
		Иначе
			ИмяСервера = ПолучитьИмяСервера(Объект.Сервер);
			Объект.СтрокаПодключения = "Srvr=" + """" + ИмяСервера + """"  +  ";Ref=" + """" + Объект.Адрес + """" +  ";";
		КонецЕсли;
		
		ПодключениеБазыУникально = ПодключениеБазыУникально(Объект.СтрокаПодключения); 

	КонецЕсли; 
		
КонецПроцедуры // ЗаполнитьАдресПодключения()        

&НаКлиенте
Функция ПодключениеБазыУникально(СтрокаПодключения)   
		
	ПодключениеБазыУникально = ВА_ВанессаСервер.ПодключениеБазыУникально(СтрокаПодключения, Объект.Ссылка);
	
	Если НЕ ПодключениеБазыУникально Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В справочнике уже заполнена база с тикой стракой подключения. Строка подключения должна быть уникальной. Проверьте, пожалуйста, данные.";
		Сообщение.Поле = "СтрокаПодключения";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();	
	КонецЕсли; 		
	
	Возврат ПодключениеБазыУникально; 

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИмяСервера(СерверСсылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СерверСсылка,"ИмяСервера");
	
КонецФункции // ПолучитьИмяСервера(СерверСсылка)




	
