
&НаСервере
Функция МакетПустойБазы()
	Возврат ПолучитьОбщийМакет("ПустаяБаза");	
КонецФункции


&НаСервере
Функция ВерсияПлатформыСтрока()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВерсияПлатформы, "Версия");
КонецФункции

&НаСервере
Функция ИмяПеречисленияПрав()
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(Права);
КонецФункции
	
&НаКлиенте
Процедура СоздатьПользователя(Команда)
	
	Если Не ЗначениеЗаполнено(Права) Тогда
		ВызватьИсключение "Не указаны права для назначения новому пользователю.";
	КонецЕсли;                                                                 
	
	Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
		ВызватьИсключение "Не указана версия платформы для подключения.";
	КонецЕсли;
	
	яВерсияПлатформыСтрока = ВерсияПлатформыСтрока();
	Если Не ЗначениеЗаполнено(ВерсияПлатформы) Тогда
		ВызватьИсключение "Не заполнена версия платформы в выбранной платформе.";
	КонецЕсли;
	
	яВремКаталог = КаталогВременныхФайлов() + "\" + Строка(Новый УникальныйИдентификатор);
	яИмяФайлаСообщений = ПолучитьИмяВременногоФайла("txt");
	
	яПутьПлатформа = """c:\Program Files\1cv8\" + яВерсияПлатформыСтрока + "\bin\1cv8.exe""";
	
	// Запись пустой подготовленной базы где есть расширение
	яПустаяБаза = МакетПустойБазы();
	яПустаяБаза.Записать(яВремКаталог + "\1Cv8.1CD");
	
	яАдрес = яПутьПлатформа + " DESIGNER"
	+ " /F """ + яВремКаталог + """"
	+ " /Out ""%4"""
	+ " /ConfigurationRepositoryF ""%1"""
	+ " /ConfigurationRepositoryN " + Логин
	+ " /ConfigurationRepositoryP " + Пароль
	+ " /ConfigurationRepositoryAddUser"
	+ " -User %2 -Pwd %3"
	+ " -Rights " + ИмяПеречисленияПрав()
	+ " -RestoreDeletedUser";
	яАдрес = СтрЗаменить(яАдрес, "%2", ИмяПользователя);
	яАдрес = СтрЗаменить(яАдрес, "%3", ПарольПользователя);
	яАдрес = СтрЗаменить(яАдрес, "%4", яИмяФайлаСообщений);
	
	Для Каждого яИД Из Элементы.Список.ВыделенныеСтроки Цикл
		яСтрока = Элементы.Список.ДанныеСтроки(яИД);
		яАдресИтог = СтрЗаменить(яАдрес, "%1", яСтрока.Адрес);
		Если яСтрока.Расширение Тогда
			// Это имя расширения зашитого в конфигурацию
			яАдресИтог = яАдресИтог + " -Extension TestMe";
		КонецЕсли;
		ЗапуститьПриложение(яАдресИтог,, Истина);
		
		// Выведем служебные сообщения в консоль
		яТД = Новый ТекстовыйДокумент;
		яТД.Прочитать(яИмяФайлаСообщений);
		яТекстСообщения = яТД.ПолучитьТекст();
		Сообщить(яТекстСообщения);
		яТД = Неопределено;
	КонецЦикла;

	УдалитьФайлы(яВремКаталог);
	УдалитьФайлы(яИмяФайлаСообщений);
	
КонецПроцедуры


&НаСервере
Процедура Тест()
	     
КонецПроцедуры
