
&НаСервере
Процедура ЗаполнитьНаСервере()
	яЗ = Новый Запрос;
	яЗ.УстановитьПараметр("", );
	яЗ.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Сотрудник,
	|	Пользователи.Подразделение КАК Подразделение,
	|	Пользователи.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО Пользователи.Подразделение = Подразделения.Ссылка
	|ГДЕ
	|	НЕ Подразделения.Ссылка ЕСТЬ NULL
	|	И НЕ Подразделения.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение,
	|	Наименование";
	
	яРезЗап = яЗ.Выполнить();
	яВ = яРезЗап.Выбрать();
	Пока яВ.Следующий() Цикл
		яНов = Объект.СписокСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(яНов, яВ, "Сотрудник");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
