
Процедура ПередЗаписью(Отказ)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(СокрЛП(ИНН+КПП)) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Ссылка,
		|	Клиенты.Код КАК Код,
		|	Клиенты.Наименование КАК Клиент
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка <> &Ссылка
		|	И Клиенты.ИНН = &ИНН
		|	И Клиенты.КПП = &КПП";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Дубли = Запрос.Выполнить().Выгрузить(); 
		Если Дубли.Количество()>0 Тогда
			Сообщить("Внимание. В базе уже есть клиенты с таким ИНН и КПП");
			Отказ = Истина;
			Для каждого СтрокаДубля ИЗ Дубли Цикл
				Сообщить("	"+СокрЛП(СтрокаДубля.Код)+" "+СокрЛП(СтрокаДубля.Клиент));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
		 
КонецПроцедуры
